Autodesk.Revit.DB.BeamSystem.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Level,System.Int32,System.Boolean)
Creates a new BeamSystem with specified profile curves.
document:
The document in which the new BeamSystem is created.
profile:
The profile of the BeamSystem.
level:
The level on which the BeamSystem is to be created.
The work-plane of the BeamSystem will be the sketch plane associated with the Level.
If there is no current sketch plane associated with the level yet, we will create a default one.
curveIndexForDirection:
Index of the curve in the profile to be used as direction.
'0' means the direction to use the first curve in profile.
The curve from the profile to be used as direction must be a Line.
is3d:
Whether the BeamSystem is 3D. If the BeamSystem is 3D, the sketchPlane must be a level, otherwise an exception will be thrown.
Returns:
If successful, a new BeamSystem object will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
-or-
The curve index must be valid and the curve to be used as direction must be a Line.
-or-
The input level does not have associated plan view.
-or-
The plan view associated with the input level is not valid.
-or-
Can not get valid sketch plane from the input level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.BeamSystem.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Level,Autodesk.Revit.DB.XYZ,System.Boolean)
Creates a new BeamSystem with specified profile curves.
document:
The document in which the new BeamSystem is created.
profile:
The profile of the BeamSystem.
level:
The level on which the BeamSystem is to be created.
The work-plane of the BeamSystem will be the sketch plane associated with the Level.
If there is no current sketch plane associated with the level yet, we will create a default one.
direction:
The direction is the direction of the BeamSystem.
is3d:
Whether the BeamSystem is 3D. If the BeamSystem is 3D, the sketchPlane must be a level, otherwise an exception will be thrown.
Returns:
If successful, a new BeamSystem object will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
-or-
The input level does not have associated plan view.
-or-
The plan view associated with the input level is not valid.
-or-
Can not get valid sketch plane from the input level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.BeamSystem.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.XYZ,System.Boolean)
Creates a new BeamSystem with specified profile curves.
document:
The document in which the new BeamSystem is created.
profile:
The profile of the BeamSystem.
sketchPlane:
The work-plane for the BeamSystem.
direction:
The direction is the direction of the BeamSystem.
is3d:
Whether the BeamSystem is 3D. If the BeamSystem is 3D, the sketchPlane must be a level, otherwise an exception will be thrown.
Returns:
If successful, a new BeamSystem object will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
SketchPlane is not valid for BeamSystem creation.
-or-
The input profile contains at least one helical curve and is not supported for this operation.
-or-
The profile curves must be in the sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The BeamSystem is 3D, but the SketchPlane is not a level.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.BeamSystem.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.SketchPlane,System.Int32)
Creates a 2D BeamSystem with specified profile curves.
document:
The document in which the new BeamSystem is created.
profile:
The profile of the BeamSystem.
sketchPlane:
The work-plane for the BeamSystem.
curveIndexForDirection:
Index of the curve in the profile to be used as direction.
'0' means the default direction-to use the first curve in profile.
The curve from the profile to be used as direction must be a Line.
Returns:
If successful, a new BeamSystem object will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
SketchPlane is not valid for BeamSystem creation.
-or-
The input profile contains at least one helical curve and is not supported for this operation.
-or-
The profile curves must be in the sketch plane.
-or-
The curve index must be valid and the curve to be used as direction must be a Line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.BeamSystem.Direction
The Direction of the BeamSystem.

Autodesk.Revit.DB.BeamSystem.LayoutRule
Retrieves or changes the LayoutRule of the BeamSystem.

Autodesk.Revit.DB.BeamSystem.Profile
Retrieve or set the profile of the BeamSystem.

Autodesk.Revit.DB.BeamSystem.BeamSystemType
Retrieves or changes the type of the BeamSystem.

Autodesk.Revit.DB.BeamSystem.BeamType
Retrieves or changes the Beam Type of the BeamSystem.

Autodesk.Revit.DB.BeamSystem.Level
Get or change the level of the BeamSystem.
When the level is changed, the elevation is changed to make the
the BeamSystem remain the location.

Autodesk.Revit.DB.BeamSystem.Elevation
Retrieves or changes the Elevation of the BeamSystem.

Autodesk.Revit.DB.BeamSystem.DropBeamSystem(Autodesk.Revit.DB.BeamSystem)
Drop beam system, it will disassociate all members from the beam system and delete the beam system.
beamSystem: The beam system to be deleted.
Since: 2011

Autodesk.Revit.DB.BeamSystem.BeamBelongsTo(Autodesk.Revit.DB.FamilyInstance)
Find out the BeamSystem to which the beam belongs.
Returns: The BeamSystem.
beam: The beam want to ask.

Autodesk.Revit.DB.BeamSystem.GetBeamIds
Gets all the beams of the BeamSystem.
Returns: The beam Ids.

Autodesk.Revit.DB.BeamSystem
An object that represents a BeamSystem within the Autodesk Revit project.
Remarks:
This object is derived from the Element base object. It can be used to access properties
of a BeamSystem, such as elevation, level, etc. It also provides access to the beams (FamilyInstances) that are created by this BeamSystem.